# Pandas

* Pandas is a package used for managing data.

* Pandas main use is that it creates 2 new data types for storing data: series and dataframe.

* Think of a pandas dataframe like an excel spreadsheet that is storing some data.

## Importing

In [1]:
import pandas as pd
import numpy as np # Had to do this because of ovious reasons

## Creating a Series 
* You can convert a list, array, or a dictionary into a series.

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
# Creating a series (way 1)
pd.Series(data=my_list) # the indexing is automatic

0    10
1    20
2    30
dtype: int64

In [4]:
# Creating a series (way 2)
pd.Series(data=my_list,index=labels) # here we gave a specific index acc to us.

a    10
b    20
c    30
dtype: int64

In [5]:
# Creating a series (way 3)
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
# Creating a series (way 4)
pd.Series(arr,labels) # directly giving the values without mentioning data & index

a    10
b    20
c    30
dtype: int32

## Data in a Series
A pandas series can hold a variety of data.

In [7]:
# Just an example..
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [8]:
# Now, just to let you know that any data can be contained..
pd.Series([sum,print,len]) # see? These are the built-in functions of python, we stored them as data.....

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Using an Index

In [9]:
# Anything can be given as an index
ser1 = pd.Series([1,2,3,4], index = ['USA','Germany','USSR','JAPAN'])

In [10]:
print(ser1)

USA        1
Germany    2
USSR       3
JAPAN      4
dtype: int64

In [11]:
# Fetching value through index (like we did in numpy)
ser1['USSR']

3

In [12]:
ser2 = pd.Series([1,2,3,4],['USA','GERMANY','ITALY','JAPAN'])

In [13]:
print(ser2)

USA        1
GERMANY    2
ITALY      3
JAPAN      4
dtype: int64

In [14]:
# Operations based on index 
ser1 + ser2 # (you will see what I did)

GERMANY    NaN
Germany    NaN
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames
Think of DataFrames as a bunch of series and objects put together

In [15]:
from numpy.random import randn # we did ths to shorten our work, you will see it in the coming steps
np.random.seed(42) # To fix a value of a random number
d = ['A','B','C','D']
e = ['W','X','Y','Z']

df = pd.DataFrame(randn(4,4),d,e) # we used 'randn' directly here rather than using(np.random.randn) because of line 1
print(df) # this is how a dataframe looks like (more like a table or a spreadsheet)

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

## Selecting and Indexing

### Column wise (particular column)

In [16]:
df['W']

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
Name: W, dtype: float64

### Multiple columns

In [17]:
df[['W','X']]

          W         X
A  0.496714 -0.138264
B -0.234153 -0.234137
C -0.469474  0.542560
D  0.241962 -1.913280

### Another way (but not recommended)

In [18]:
df.W

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
Name: W, dtype: float64

### Datatype

In [19]:
type(df['W'])

pandas.core.series.Series

### Creating a new column

In [20]:
# Preassuming a column and inserting a operation to it
df['new'] = df['W'] + df['X']

In [21]:
print(df)  # see new column is added

          W         X         Y         Z       new
A  0.496714 -0.138264  0.647689  1.523030  0.358450
B -0.234153 -0.234137  1.579213  0.767435 -0.468290
C -0.469474  0.542560 -0.463418 -0.465730  0.073086
D  0.241962 -1.913280 -1.724918 -0.562288 -1.671318

### Removing a column

In [22]:
df.drop('new',axis=1) # removes the column mentioned (axis = 1 means column, axis = 0 means rows)

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [23]:
# but you see the dataframe is the same
print(df)

          W         X         Y         Z       new
A  0.496714 -0.138264  0.647689  1.523030  0.358450
B -0.234153 -0.234137  1.579213  0.767435 -0.468290
C -0.469474  0.542560 -0.463418 -0.465730  0.073086
D  0.241962 -1.913280 -1.724918 -0.562288 -1.671318

In [24]:
# So, to change that, we need to add one more thing
df.drop('new',axis=1,inplace=True) # inplace = True makes it permanent

In [25]:
print(df)

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

### Removing a row

In [26]:
df.drop('B',axis=0,inplace=True)

In [27]:
print(df)

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

### Selecting a row ( via label name)

In [28]:
# loc
df.loc['A']

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

### Selecting a row ( via index no)

In [29]:
# iloc
df.iloc[0]

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

### Selecting a particular part of a df

In [30]:
df.loc['A','Y'] # (rows,cols)

0.6476885381006925

In [31]:
df.loc[['A','C'],['W','Y']]

          W         Y
A  0.496714  0.647689
C -0.469474 -0.463418

### Conditional selection

In [32]:
# Every operation will return a boolean value, untill I do something
df>2

       W      X      Y      Z
A  False  False  False  False
C  False  False  False  False
D  False  False  False  False

In [33]:
df<1

      W     X     Y      Z
A  True  True  True  False
C  True  True  True   True
D  True  True  True   True

In [34]:
# Now to get the exact output (Non Boolean)

df[df<1] # Indexing the condition....

          W         X         Y         Z
A  0.496714 -0.138264  0.647689       NaN
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [35]:
df[df>1]

    W   X   Y        Z
A NaN NaN NaN  1.52303
C NaN NaN NaN      NaN
D NaN NaN NaN      NaN

In [36]:
# Advancing it a bit
df[df['W']>0] [['W','Y']] # The last part is the columns I want to display...

          W         Y
A  0.496714  0.647689
D  0.241962 -1.724918

### For multiple conditions..

In [39]:
df[(df['W']>1) | (df['Y']<0)]  # '|' refers to OR

          W        X         Y         Z
C -0.469474  0.54256 -0.463418 -0.465730
D  0.241962 -1.91328 -1.724918 -0.562288

In [40]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [41]:
df[(df['W']>=0) & (df['Y']<1)]  # '&' refers to AND

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
D  0.241962 -1.913280 -1.724918 -0.562288

## More Index Details..

### reset_index()

In [42]:
# Reseting the index
df.reset_index(drop= True, inplace=True)

In [44]:
df # see what happened here...

          W         X         Y         Z
0  0.496714 -0.138264  0.647689  1.523030
1 -0.469474  0.542560 -0.463418 -0.465730
2  0.241962 -1.913280 -1.724918 -0.562288

In [47]:
# Advance example...
rewind = "CA NY OR".split() # Split func splits the string from spaces and converts it into a list.. 
print(rewind) # see...

['CA', 'NY', 'OR']

In [48]:
df['States'] = rewind # Adding a new column as we saw earlier

In [49]:
df

          W         X         Y         Z States
0  0.496714 -0.138264  0.647689  1.523030     CA
1 -0.469474  0.542560 -0.463418 -0.465730     NY
2  0.241962 -1.913280 -1.724918 -0.562288     OR

### set_index()

In [50]:
# Setting the states col as index
df.set_index('States')

               W         X         Y         Z
States
CA      0.496714 -0.138264  0.647689  1.523030
NY     -0.469474  0.542560 -0.463418 -0.465730
OR      0.241962 -1.913280 -1.724918 -0.562288

## Multi-Index & Index Hierarchy

In [51]:
# Example... (Advance)
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # zip function works on an iteration and zips together 1st value with the 1st, 2nd with 2nd and so on and so forth...
hier_index = pd.MultiIndex.from_tuples(hier_index) # creating a multi-index

In [52]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["A","B"])

In [53]:
df

             A         B
G1 1 -1.012831  0.314247
   2 -0.908024 -1.412304
   3  1.465649 -0.225776
G2 1  0.067528 -1.424748
   2 -0.544383  0.110923
   3 -1.150994  0.375698

In [54]:
df.loc['G1']

          A         B
1 -1.012831  0.314247
2 -0.908024 -1.412304
3  1.465649 -0.225776

In [55]:
df.loc['G2'].loc[1] # Advance locking (combining 2 types of .loc)

A    0.067528
B   -1.424748
Name: 1, dtype: float64

### giving index names

In [56]:
df.index.names = ['Group','Num']

In [57]:
df

                  A         B
Group Num
G1    1   -1.012831  0.314247
      2   -0.908024 -1.412304
      3    1.465649 -0.225776
G2    1    0.067528 -1.424748
      2   -0.544383  0.110923
      3   -1.150994  0.375698

### cross-section

In [58]:
df.xs('G1') # The xs() function is used to get cross-section from the Series/DataFrame.

            A         B
Num
1   -1.012831  0.314247
2   -0.908024 -1.412304
3    1.465649 -0.225776

In [59]:
df.xs(['G1',1])

A   -1.012831
B    0.314247
Name: (G1, 1), dtype: float64

In [60]:
df.xs(1, level = 'Num') # specifying index

              A         B
Group
G1    -1.012831  0.314247
G2     0.067528 -1.424748

## Missing Data

In [61]:
df = pd.DataFrame({'A':[1,2,np.nan], # np.nan means null values
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})

In [62]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### dropna()
drops every null value

In [63]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [64]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [66]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [67]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [68]:
df.dropna(thresh=2) # thresh = 2 means a row which has a minimun of 2 non-null values.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### fillna()
Used to fill the null values

In [69]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [70]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [71]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [72]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## GroupBy
Allows you to group rows of data together and call aggregate function.

In [80]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person': ['Pratik','Priyank','Kevin','Nirav','Dhagash','Kishan'],
        'Sales': [200,120,340,124,243,350]}

In [82]:
df = pd.DataFrame(data)

In [83]:
df

  Company   Person  Sales
0    GOOG   Pratik    200
1    GOOG  Priyank    120
2    MSFT    Kevin    340
3    MSFT    Nirav    124
4      FB  Dhagash    243
5      FB   Kishan    350

In [84]:
# A lengthy way....
df.groupby('Company')

In [85]:
by_comp = df.groupby('Company')

In [86]:
by_comp.mean() # mean means average

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [87]:
# Shorter way
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [90]:
# Using diff aggregate functions
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [91]:
by_comp.max() # maximum value

          Person  Sales
Company
FB        Kishan    350
GOOG     Priyank    200
MSFT       Nirav    340

In [92]:
by_comp.min() # minimum value

          Person  Sales
Company
FB       Dhagash    243
GOOG      Pratik    120
MSFT       Kevin    124

In [93]:
by_comp.count() # Count gives no. of occurences

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [94]:
by_comp.describe() # Descibe gives every detail

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
by_comp.describe().transpose() # Transpose converts rows to cols

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Merging, Joinig, and Cocatenating

### Concatenation
Glues dataframes together (dimensions should match)

In [102]:
# Creating 2 dataframes
df1 = pd.DataFrame(np.random.randn(5,4),columns=["A","B","C","D"])

In [103]:
df1

          A         B         C         D
0  0.361636 -0.645120  0.361396  1.538037
1 -0.035826  1.564644 -2.619745  0.821903
2  0.087047 -0.299007  0.091761 -1.987569
3 -0.219672  0.357113  1.477894 -0.518270
4 -0.808494 -0.501757  0.915402  0.328751

In [105]:
df2 = pd.DataFrame(data)

In [107]:
df2['Random'] = df['Sales'].mean() # Creating a new column

In [111]:
df2.drop(5,axis=0,inplace=True) # I told you dimensions should be same, so did this...

In [112]:
df2

  Company   Person  Sales  Random
0    GOOG   Pratik    200   229.5
1    GOOG  Priyank    120   229.5
2    MSFT    Kevin    340   229.5
3    MSFT    Nirav    124   229.5
4      FB  Dhagash    243   229.5

In [115]:
pd.concat([df1,df2],axis=1) # Concatenating on columns

          A         B         C         D Company   Person  Sales  Random
0  0.361636 -0.645120  0.361396  1.538037    GOOG   Pratik    200   229.5
1 -0.035826  1.564644 -2.619745  0.821903    GOOG  Priyank    120   229.5
2  0.087047 -0.299007  0.091761 -1.987569    MSFT    Kevin    340   229.5
3 -0.219672  0.357113  1.477894 -0.518270    MSFT    Nirav    124   229.5
4 -0.808494 -0.501757  0.915402  0.328751      FB  Dhagash    243   229.5

In [117]:
pd.concat([df1,df2],axis=0) # concatenating on rows

          A         B         C         D Company   Person  Sales  Random
0  0.361636 -0.645120  0.361396  1.538037     NaN      NaN    NaN     NaN
1 -0.035826  1.564644 -2.619745  0.821903     NaN      NaN    NaN     NaN
2  0.087047 -0.299007  0.091761 -1.987569     NaN      NaN    NaN     NaN
3 -0.219672  0.357113  1.477894 -0.518270     NaN      NaN    NaN     NaN
4 -0.808494 -0.501757  0.915402  0.328751     NaN      NaN    NaN     NaN
0       NaN       NaN       NaN       NaN    GOOG   Pratik  200.0   229.5
1       NaN       NaN       NaN       NaN    GOOG  Priyank  120.0   229.5
2       NaN       NaN       NaN       NaN    MSFT    Kevin  340.0   229.5
3       NaN       NaN       NaN       NaN    MSFT    Nirav  124.0   229.5
4       NaN       NaN       NaN       NaN      FB  Dhagash  243.0   229.5

### Merging
Allows you to merge dataframes together using similar logic as merging in SQL datbase. Needs to have similar column.

In [121]:
# Creating similar columns
df1['Key'] = [1,2,3,4,5]

In [122]:
df2['Key'] = [1,2,3,4,5]

In [123]:
df1

          A         B         C         D  Key
0  0.361636 -0.645120  0.361396  1.538037    1
1 -0.035826  1.564644 -2.619745  0.821903    2
2  0.087047 -0.299007  0.091761 -1.987569    3
3 -0.219672  0.357113  1.477894 -0.518270    4
4 -0.808494 -0.501757  0.915402  0.328751    5

In [124]:
df2

  Company   Person  Sales  Random  Key
0    GOOG   Pratik    200   229.5    1
1    GOOG  Priyank    120   229.5    2
2    MSFT    Kevin    340   229.5    3
3    MSFT    Nirav    124   229.5    4
4      FB  Dhagash    243   229.5    5

In [126]:
pd.merge(df1,df2,how='inner',on='Key') # see....

          A         B         C         D  Key Company   Person  Sales  Random
0  0.361636 -0.645120  0.361396  1.538037    1    GOOG   Pratik    200   229.5
1 -0.035826  1.564644 -2.619745  0.821903    2    GOOG  Priyank    120   229.5
2  0.087047 -0.299007  0.091761 -1.987569    3    MSFT    Kevin    340   229.5
3 -0.219672  0.357113  1.477894 -0.518270    4    MSFT    Nirav    124   229.5
4 -0.808494 -0.501757  0.915402  0.328751    5      FB  Dhagash    243   229.5

### Joining
Used to combine the columns of two potentially diff-indexed dataframes into a single result.

In [135]:
df1 = pd.DataFrame(data,index=[5,6,7,8,9,10])

In [136]:
df1

   Company   Person  Sales
5     GOOG   Pratik    200
6     GOOG  Priyank    120
7     MSFT    Kevin    340
8     MSFT    Nirav    124
9       FB  Dhagash    243
10      FB   Kishan    350

In [150]:
df2 = pd.DataFrame(np.random.randn(5,3),columns=["A","B","C"])

In [151]:
df2

          A         B         C
0  1.142823  0.751933  0.791032
1 -0.909387  1.402794 -1.401851
2  0.586857  2.190456 -0.990536
3 -0.566298  0.099651 -0.503476
4 -1.550663  0.068563 -1.062304

In [155]:
df2.join(df1,how='outer') # joining both the columns

           A         B         C Company   Person  Sales
0   1.142823  0.751933  0.791032     NaN      NaN    NaN
1  -0.909387  1.402794 -1.401851     NaN      NaN    NaN
2   0.586857  2.190456 -0.990536     NaN      NaN    NaN
3  -0.566298  0.099651 -0.503476     NaN      NaN    NaN
4  -1.550663  0.068563 -1.062304     NaN      NaN    NaN
5        NaN       NaN       NaN    GOOG   Pratik  200.0
6        NaN       NaN       NaN    GOOG  Priyank  120.0
7        NaN       NaN       NaN    MSFT    Kevin  340.0
8        NaN       NaN       NaN    MSFT    Nirav  124.0
9        NaN       NaN       NaN      FB  Dhagash  243.0
10       NaN       NaN       NaN      FB   Kishan  350.0

## Operations

### Info & Unique

In [158]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 5 to 10
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 352.0+ bytes

In [159]:
df1['Company'].unique() # unique values

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [160]:
df1['Company'].nunique() # number of unique values

3

### applying functions

In [162]:
def times2(x):
    return x*2

In [163]:
df1['Sales'].apply(times2)

5     400
6     240
7     680
8     248
9     486
10    700
Name: Sales, dtype: int64

### getting columns & index

In [165]:
df1.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [166]:
df1.index

Int64Index([5, 6, 7, 8, 9, 10], dtype='int64')

### sorting & ordering a df

In [171]:
df1.sort_values(by='Sales') # sorting values acc to sales (asc)

   Company   Person  Sales
6     GOOG  Priyank    120
8     MSFT    Nirav    124
5     GOOG   Pratik    200
9       FB  Dhagash    243
7     MSFT    Kevin    340
10      FB   Kishan    350

### finding null values or checking for it....

In [174]:
df.isnull() # returns boolean

   Company  Person  Sales
0    False   False  False
1    False   False  False
2    False   False  False
3    False   False  False
4    False   False  False
5    False   False  False

In [175]:
# Now what did I teach you?
df[df.isnull()] # remember??

  Company Person  Sales
0     NaN    NaN    NaN
1     NaN    NaN    NaN
2     NaN    NaN    NaN
3     NaN    NaN    NaN
4     NaN    NaN    NaN
5     NaN    NaN    NaN

In [176]:
df.dropna() # drops the null values ( we did it earlier)

  Company   Person  Sales
0    GOOG   Pratik    200
1    GOOG  Priyank    120
2    MSFT    Kevin    340
3    MSFT    Nirav    124
4      FB  Dhagash    243
5      FB   Kishan    350

In [177]:
df.fillna('Fill') # fills the null values

  Company   Person  Sales
0    GOOG   Pratik    200
1    GOOG  Priyank    120
2    MSFT    Kevin    340
3    MSFT    Nirav    124
4      FB  Dhagash    243
5      FB   Kishan    350

### pivot table

In [185]:
df2 = pd.DataFrame(np.random.randn(5,4),columns=('A B C D').split())
df2

          A         B         C         D
0  0.341152  0.276691  0.827183  0.013002
1  1.453534 -0.264657  2.720169  0.625667
2 -0.857158 -1.070892  0.482472 -0.223463
3  0.714000  0.473238 -0.072829 -0.846794
4 -1.514847 -0.446515  0.856399  0.214094

In [190]:
df2.pivot_table(values='C',index=["A",'B'],columns=['D']) # pivot table...

D                    -0.846794  -0.223463   0.013002   0.214094   0.625667
A         B
-1.514847 -0.446515        NaN        NaN        NaN   0.856399        NaN
-0.857158 -1.070892        NaN   0.482472        NaN        NaN        NaN
 0.341152  0.276691        NaN        NaN   0.827183        NaN        NaN
 0.714000  0.473238  -0.072829        NaN        NaN        NaN        NaN
 1.453534 -0.264657        NaN        NaN        NaN        NaN   2.720169

## Data Input & Output

### csv

In [192]:
# csv file (input)
pd.read_csv('Uber Drives.csv').head() # head() gives first 5 rows

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [193]:
# csv file (output)
df1.to_csv('df2',index=False)

### Excel

In [197]:
# Excel (input)
pd.read_excel('dad_data.xlsx').head(2)

,User,Firm Name,Contact Person,Mobile Number,Contact person Designation,Hub,Customer Category,Usage/Application,Sub-Usage/Application,Key Buying Factor,Major Route,Satisfaction Level
0,Sanjay Vyas,NaN,Jivanbhai Patel,9879838246,Propritor,Surendranagar,HCV Tipper,Construction and Related,Stones/ Gitti/ Chips/ Blue metal,Better Mileage/ Fuel Efficiency,Morbi-Hyedrabad,-
1,Sanjay Vyas,Darson Stone,Dhiru bhai Meniya,9099925351,Partner,Syela (Morvad village),HCV Tipper,Mining,Light Mining,Better Mileage/ Fuel Efficiency,Fulgram-Ahemdabad,-

In [198]:
# Excel (output)
df1.to_excel('df1.xlsx',sheet_name='Sheet 1')